Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext
The Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext class provides a base class for custom manipulation behavior classes.
Tekla.BIM.DirectManipulation.Services.Manipulators.Manipulator

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.disposed
Indicates whether all internal resources have been disposed of.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.manipulators
The manipulators.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.#ctor(Tekla.Structures.Model.Component,Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginManipulationFeatureBase)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext class.
component: The component.
feature: The feature.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.#ctor(Tekla.Structures.Model.CustomPart,Tekla.Structures.Plugins.DirectManipulation.Core.Features.CustomPartPluginManipulationFeatureBase)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext class.
customPart: The custom part.
feature: The feature.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.Manipulators
Gets the attached manipulators.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.Component
Gets or sets the component.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.CustomPart
Gets the custom part.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.Graphics
Gets the graphics.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.ParentFeature
Gets the parent feature.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.Dispose
Releases unmanaged and - optionally - managed resources.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.AddManipulator(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase)
Adds the manipulator.
newManipulator: The manipulator.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.UpdateContext
Updates the context.
Remarks:
This method must be overridden to update the manipulation context.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.Dispose(System.Boolean)
Releases unmanaged and - optionally - managed resources.
disposing: true to release both managed and unmanaged resources; false to release only unmanaged resources.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.ModifyComponentInput(Tekla.Structures.Model.ComponentInput)
Modifies the component input.
input: The input.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.ModifyCustomPartInput(Tekla.Structures.Model.Polygon)
Modifies the custom part input.
input: The input.

Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext.SetHandleContextualToolbar(Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase,System.Action{Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar})
Sets the contextual toolbar for a Tekla.Structures.Plugins.DirectManipulation.Core.HandleBase.
handle: The handle.
defineToolbar: A delegate to define the toolbar.